{"_id":{"$oid":"5ddc90c750b6ed442cc9e741"},"title":"The Secret Life of Pets 2","rating":4.2,"year":2019,"description":"The Secret Life of Pets 2 continues the story of Max (Patton Oswalt), Gidget (Jenny Slate), Snowball (Kevin Hart) and the rest of the gang as they take on new adventures and are pushed to find the courage to become their own heroes. Explore the emotional lives of our pets - the deep bond between them, the families that love them - and find out what your pets are really doing when you're not at home.","duration":86,"director":["Chris Renaud"],"cast":["Kevin Hart","Harrison Ford","Patton Oswalt","Eric Stonestreet","Jenny Slate","Tiffany Haddish","Lake Bell","Nick Kroll","Dana Carvey","Ellie Kemper"],"price":9.99,"quantity":17,"image":"secretlifeofpets2.webp","inStock":true,"isDeleted":false,"genre":"Comedy"}
{"_id":{"$oid":"5ddc859850b6ed442cc9e52a"},"title":"The Lion King","rating":4,"year":2019,"description":"Disney's The Lion King, directed by Jon Favreau, journeys to the African savanna, where a future king is born. Simba idolizes his father, King Mufasa, and takes to heart his own royal destiny. But not everyone in the kingdom celebrates the new cub's arrival. Scar, Mufasa's brother-and former heir to the throne-has plans of his own. The battle for Pride Rock is ravaged with betrayal, tragedy and drama, ultimately resulting in Simba's exile. With help from a curious pair of newfound friends, Simba will have to figure out how to grow up and take back what is rightfully his. The all-star cast includes Donald Glover as Simba, Beyoncé Knowles-Carter as Nala, James Earl Jones as Mufasa, Chiwetel Ejiofor as Scar, Seth Rogen as Pumbaa and Billy Eichner as Timon. Disney's The Lion King utilizes pioneering filmmaking techniques to bring treasured characters to life in a whole new way.","duration":118,"director":["Jon Favreau"],"cast":["Donald Glover","Seth Rogen","Chiwetel Ejiofor","Alfre Woodard"],"price":19.99,"quantity":10,"image":"lionking.webp","inStock":true,"isDeleted":false,"genre":"Action & adventure"}
{"_id":{"$oid":"5ddc873550b6ed442cc9e57e"},"title":"Toy Story 4","rating":4.2,"year":2019,"description":"Pixar Animation Studios proudly presents the adventure of a lifetime! When Woody, Buzz and the gang join Bonnie on a road trip with her new craft-project-turned-toy, Forky, the innocent little spork's hilarious antics launch Woody on a wild quest filled with unexpected new characters-and one long-lost friend! Toy Story 4 is a soaring masterpiece stuffed with spectacular animation, humor and heart.","duration":100,"director":["Rick Salt"],"cast":["Bang Bang","Racheal","Tony","Ramesh Killer"],"price":16.99,"quantity":2,"image":"toystory4.webp","inStock":true,"isDeleted":false,"genre":"Action & adventure"}
{"_id":{"$oid":"5ddc92a750b6ed442cc9e79d"},"title":"Fast & Furious Presents: Hobbs & Shaw","rating":4,"year":2019,"description":"Dwayne Johnson and Jason Statham return to their unforgettable roles as Hobbs and Shaw in this action-packed feature from the blockbuster Fast & Furious franchise! For years, hulking lawman Luke Hobbs (Johnson) and lawless outcast Deckard Shaw (Statham) have traded smack talk and body blows. But when cyber-genetically enhanced anarchist Brixton (Idris Elba) gains control of an insidious bio-threat that could alter humanity forever, Hobbs and Shaw must partner up to bring down the only guy who might be badder than themselves!","duration":136,"director":"David Leitch","cast":["Dwayne Johnson","Jason Statham","Idris Elba","Vanessa Kirby","Eiza Gonzalez","Cliff Curtis","Helen Mirren"],"price":19.99,"quantity":0,"image":"fast&furioushobbs&shaw.webp","inStock":false,"isDeleted":false,"genre":"Action & adventure"}
{"_id":{"$oid":"5ddc943d50b6ed442cc9e803"},"title":"IT Chapter Two","rating":4.3,"year":2019,"description":"Because every 27 years evil revisits the town of Derry, Maine, “IT Chapter Two” brings the characters—who’ve long since gone their separate ways—back together as adults, nearly three decades after the events of the first film.","duration":170,"director":["Andy Muschietti"],"cast":[["Jessica Chastain","James McAvoy","Bill Hader","Isaiah Mustafa","Jay Ryan","James Ransone","Andy Bean","Bill Skarsgård","Jaeden Lieberher","Wyatt Oleff","Jack Dylan Grazer","Finn Wolfhard","Sophia Lillis","Chosen Jacobs","Jeremy Ray Taylor","Javier Botet","Jess Weixler","Stephen Bogaert"]],"price":21.99,"quantity":8,"image":"itchaptertwo.webp","inStock":true,"isDeleted":true,"genre":"Horror"}
{"_id":{"$oid":"5ddc96f650b6ed442cc9e89d"},"title":"Marvel Studios' Avengers: Infinity War","rating":4.8,"year":2018,"description":"An unprecedented cinematic journey ten years in the making and spanning the entire Marvel Cinematic Universe, Marvel Studios' Avengers: Inﬁnity War brings to the screen the ultimate showdown of all time. The Avengers and their Super Hero allies must be willing to sacriﬁce all in an attempt to defeat the powerful Thanos.","duration":149,"director":["Anthony Russo","Joe Russo"],"cast":["Robert Downey Jr.","Chris Hemsworth","Mark Ruffalo","Chris Evans","Scarlett Johansson","Don Cheadle","Benedict Cumberbatch","Tom Holland","Chadwick Boseman","Zoe Saldana","Karen Gillan","Tom Hiddleston","Paul Bettany","Elizabeth Olsen","Anthony Mackie","Sebastian Stan","Idris Elba","Danai Gurira","Peter Dinklage"],"price":14.99,"quantity":0,"image":"avengersinfinitywar.webp","inStock":false,"isDeleted":false,"genre":"Action & adventure"}
{"_id":{"$oid":"5de04d1fb03d8a1b310d87fa"},"title":"Dumbo","rating":4.5,"year":2019,"description":"From Disney and visionary director Tim Burton, the grand live-action adventure Dumbo expands on the beloved classic story where differences are celebrated, family is cherished and dreams take flight. Circus owner Max Medici (Danny DeVito) enlists former star Holt Farrier (Colin Farrell) and his children to care for a newborn elephant whose oversized ears make him a laughingstock in an already struggling circus. But when they discover that Dumbo can fly, the circus makes an incredible comeback, attracting persuasive entrepreneur V. A. Vandevere (Michael Keaton), who recruits the peculiar pachyderm for his newest, larger-than-life entertainment venture, Dreamland. Dumbo soars to new heights alongside the charming and spectacular aerial artist Colette Marchant (Eva Green)-until Holt learns that beneath its shiny veneer, Dreamland is full of dark secrets.","duration":111,"director":["Tim Burton"],"cast":[["Colin Farrell","Michael Keaton","Danny DeVito","Eva Green"]],"price":7.99,"quantity":3,"image":"dumbo.webp","inStock":false,"isDeleted":true,"genre":"Family"}
{"_id":{"$oid":"5ddca4fb50b6ed442cc9eb97"},"title":"Zootopia","rating":4.8,"year":2020,"description":"Disney presents a heartwarming comedy-adventure set in the modern mammal metropolis of Zootopia. With habitat neighborhoods like ritzy Sahara Square and frigid Tundratown, it’s a melting pot where animals from every environment live together—a place where no matter what you are, from the biggest elephant to the smallest shrew, you can be anything. But when optimistic Officer Judy Hopps arrives, she discovers that being the first bunny on a police force of big, tough animals isn’t so easy. Determined to prove herself, she jumps at the opportunity to crack a case, even if it means partnering with fast-talking scam-artist fox Nick Wilde to solve the mystery.","duration":108,"director":["Byron Howard","Rich Moore"],"cast":["Ginnifer Goodwin","Jason Bateman","Idris Elba","Jenny Slate","Nate Torrence","Bonnie Hunt","Don Lake","Tommy Chong","J.K. Simmons","Octavia Spencer","Alan Tudyk","Shakira","Raymond S. Persi","Della Saba","Maurice LaMarche","Phil Johnston","Fuschia","John DiMaggio","Katie Lowes","Gita Reddy","Jesse Corti","Tiny Lister"],"price":12.99,"quantity":2,"image":"zootopia.webp","inStock":true,"isDeleted":false,"genre":"Animation"}
{"_id":{"$oid":"5ddc890b50b6ed442cc9e5d6"},"title":"Aladdin","rating":4.4,"year":2017,"description":"Try to Experience the thrilling and vibrant live-action adaptation of the animated classic Aladdin, the exciting tale of the charming street rat Aladdin (Mena Massoud), the courageous, self-determined Princess Jasmine (Naomi Scott)-and Will Smith as the larger-than-life Genie who may be the key to their future!","duration":120,"director":[[[[[[[[[[[[["Guy Ritchie"]]]]]]]]]]]]],"cast":[[["Vedant","Will Smith","Mena Massoud","Naomi Scott","Marwan Kenzari","Navid Negahban","Nasim Pedrad","Billy Magnussen","Numan Acar","Jordan Nash","Taliyah Blair","Aubrey Lin","Amir Boutrous","Omari Bernard","Nathaniel Ellul"]]],"price":10.99,"quantity":10,"image":"aladdin.webp","inStock":false,"isDeleted":true,"genre":"Action & adventure"}
{"_id":{"$oid":"5de04d1fb03d8a1b310d87fd"},"title":"Downton Abbey","rating":4.7,"year":2018.0,"description":"The worldwide phenomenon, Downton Abbey, returns in a spectacular motion picture, as the beloved Crawleys and their intrepid staff prepare for the most important moment of their lives. A royal visit from the King and Queen of England unleashes scandal, romance and intrigue that leave the future of Downton hanging in the balance. Written by series creator Julian Fellowes and starring the original cast, this grand cinematic experience will have you cheering for your favorite characters all over again.","duration":125.0,"director":"Jim Carter","cast":["Maggie Smith","Imelda Staunton","Penelope Wilton"],"price":9.99,"quantity":2.0,"image":"downton.webp","inStock":false,"isDeleted":false,"genre":"Drama"}
{"_id":{"$oid":"5de04d1fb03d8a1b310d87fe"},"title":"Anna","rating":4.9,"year":2019.0,"description":"Beneath Anna Poliatova's striking beauty lies a secret that will unleash her indelible strength and skill to become one of the world's most feared government assassins. An electrifying thrill ride unfolding with propulsive energy, startling twists and breathtaking action, ANNA introduces Sasha Luss in the title role with a star-studded cast including Academy Award Winner Helen Mirren, Cillian Murphy, and Luke Evans.","duration":111.0,"director":"Graham Bell","cast":["Sasha Luss","Helen Mirren","Luke Evans","Cillian Murphy"],"price":9.99,"quantity":6.0,"image":"anna.webp","inStock":true,"isDeleted":false,"genre":"Action & adventure"}
{"_id":{"$oid":"5de04d1fb03d8a1b310d87ff"},"title":"Apollo 11","rating":4.3,"year":2019.0,"description":"From director Todd Douglas Miller (Dinosaur 13) comes a cinematic event 50 years in the making. Crafted from a newly discovered trove of 65mm footage, and more than 11,000 hours of uncatalogued audio recordings, Apollo 11 takes us straight to the heart of NASA's most celebrated mission—the one that first put men on the moon, and forever made Neil Armstrong and Buzz Aldrin into household names. Immersed in the perspectives of the astronauts, the team in Mission Control, and the millions of spectators on the ground, we vividly experience those momentous days and hours in 1969 when humankind took a giant leap into the future.","duration":93.0,"director":"Todd Douglas Miller","cast":["Todd Douglas Miller","Thomas Petersen","Evan Krauss"],"price":13.99,"quantity":6.0,"image":"apollo.webp","inStock":true,"isDeleted":false,"genre":"Documentary"}
{"_id":{"$oid":"5de04d1fb03d8a1b310d8801"},"title":"WWE: Hell in a Cell 2019","rating":4.8,"year":2019.0,"description":"Universal Champion Seth Rollins defends his title against The Fiend Bray Wyatt inside Hell in a Cell. Sasha Banks returns to the Cell to challenge Raw Women's Champion Becky Lynch. Plus, Daniel Bryan teams with Roman Reigns to take on Erick Rowan & Luke Harper and much more action.","duration":191.0,"director":"WWE","cast":["Charlotte Flair","Roman Reigns","Sasha Banks","Seth Rollins"],"price":19.99,"quantity":7,"image":"hell.webp","inStock":true,"isDeleted":false,"genre":"Sports"}
{"_id":{"$oid":"5de04d1fb03d8a1b310d8800"},"title":"WWE: Money in the Bank 2019","rating":5.0,"year":2019.0,"description":"Kofi Kingston defends the WWE Championship against Kevin Owens. Seth Rollins and AJ Styles compete for the Universal Championship. Superstars from Raw and SmackDown LIVE battle for an opportunity at championship gold in two action-packed Money in the Bank Ladder Matches.","duration":210.0,"director":"AJ","cast":["Mizanian","Roman Reigns","Seth Rollins"],"price":5.99,"quantity":9.0,"image":"wwe.webp","inStock":true,"isDeleted":false,"genre":"Sports"}
{"_id":{"$oid":"5de04d1fb03d8a1b310d8802"},"title":"HoneyLand","rating":4.6,"year":2019,"description":"Hatidze lives with her ailing mother in the mountains of Macedonia, making a living cultivating honey using ancient beekeeping traditions. When an unruly family moves in next door, what at first seems like a balm for her solitude becomes a source of tension as they, too, want to practice beekeeping, while disregarding her advice. The most awarded film at the 2019 Sundance Film Festival, Honeyland is an epic, visually stunning portrait of the delicate balance between nature and humanity that has something sweet for everyone.","duration":89,"director":["Tamara Kotevska"],"cast":["Atanas Georgiev"],"price":29.99,"quantity":7,"image":"honeyland.webp","inStock":true,"isDeleted":false,"genre":"Documentary"}
{"_id":{"$oid":"5de04d1fb03d8a1b310d8804"},"title":"The Brink","rating":2.5,"year":2019.0,"description":"The Brink follows Steve Bannon for a year leading up to the 2018 mid-term elections in the United States, shedding light on his efforts to mobilize and unify far-right parties in order to win seats in the May 2019 European Parliamentary elections. To maintain his power and influence, the former Goldman Sachs banker and media investor reinvents himself - as he has many times before - this time as the self-appointed leader of a global populist movement. A keen manipulator of the press and gifted self-promoter, Bannon continues to draw headlines and protests wherever he goes, feeding the powerful myth on which his survival relies.","duration":91.0,"director":"Alison Klayman","cast":["Alison Klayman","Marie Therese Guirgis"],"price":15.99,"quantity":1.0,"image":"brink.webp","inStock":true,"isDeleted":false,"genre":"Documentary"}
{"_id":{"$oid":"5de04d1fb03d8a1b310d87fb"},"title":"John Wick: Chapter 3 - Parabellum","rating":4.1,"year":2019,"description":"In this third installment of the adrenaline-fueled action franchise, super-assassin John Wick (Keanu Reeves) returns with a $14 million price tag on his head and an army of bounty-hunting killers on his trail. After killing a member of the shadowy international assassin’s guild, the High Table, John Wick is excommunicado, but the world’s most ruthless hit men and women await his every turn.","duration":110,"director":["Jose Live"],"cast":["Harry Taylor","Vincent Andriano","Liam Bewley"],"price":11.99,"quantity":8,"image":"JohnWick.webp","inStock":true,"isDeleted":false,"genre":"Action & adventure"}
{"_id":{"$oid":"5de04d1fb03d8a1b310d8805"},"title":"Bhai - Vyakti Ki Valli - Uttarardha","rating":3.2,"year":2019.0,"description":"Bhai – Vyakti Kee Valli Part 2 covers PuLa’s (played by Sagar Deshmukh and Vijay Kenkre) life as an artist, as a person, as a husband, and as a friend. The film showcases his relationships with musical geniuses like Kumar Gandharva, Bhimsen Joshi, Vasant Deshpande, with politico Bala Saheb Thackeray, and with social worker Baba Amte. Right from the beginning, Bhaai gives you a glimpse into the life of a magnificent man PuLa and his better half Sunita. Feeling so close to PuLa is both moving and overwhelming, frankly. CBFC U (DIL/1/31/2019-MUM)","duration":95.0,"director":"Ratnakar Matkari","cast":["Satish Alekar","Vijay Kenkre","Veena Jamkar","Mahesh Manjrekar"],"price":1.99,"quantity":0,"image":"bhai.webp","inStock":false,"isDeleted":false,"genre":"Drama"}
{"_id":{"$oid":"5de04d1fb03d8a1b310d8803"},"title":"Jamie Anderson's Unconditional","rating":4.1,"year":2019.0,"description":"As a daughter of the Sierra, Jamie Anderson grew up on the slopes of the South Shore of Lake Tahoe. Her prodigious talents as a preteen snowboarding savant made her a podium contender from the moment she arrived at the X Games in Aspen more than a decade ago. Since then, Jamie has amassed more X Games and Olympic medals than any other woman in history. Yet, being the best competitive snowboarder of all time is an asterisk that Jamie leaves behind as she pursues even greater riding challenges far from the contest circuit. Powder, slush, corduroy, and pillows, Unconditional presents the wide pan of Jamie’s 2019 season as she sets out to expand her horizons beyond the contest bib.","duration":20.0,"director":"Pat Bridges","cast":["Stefi Luxton","Yuka Fujimori","Mikey Ceccarelli","Alexis Roland","Maria Thomsen"],"price":10.99,"quantity":5.0,"image":"uncond.webp","inStock":true,"isDeleted":false,"genre":"Sports"}
{"_id":{"$oid":"5de04d1fb03d8a1b310d8807"},"title":"24h Le Mans Official Review 2019","rating":2.7,"year":2019.0,"description":"Toyota’s unique brand of luck came to the fore once again at the 2019 edition of the 24 Hours of Le Mans. Although the race finished with a 1-2 for the Toyota Gazoo Racing team, the finishing order saw a dramatic change in the final hours of the action, in a way that always seems to strike Toyota on the Circuit de la Sarthe. The 24 Hours of Le Mans is always about more than which car crosses the line first. The action-packed official review distills the surprise, excitement and drama of an entire day and night’s racing into four thrilling hours of high-quality entertainment. Follow the stories in every class as teams and drivers set out to make their mark on the history books. The challenge of driving at the limit through the night, hour after hour at speeds approaching 200mph on the straights, negotiating notorious corners with famous names such as Mulsanne, Indianapolis, Arnage, Esses and Terte Rouge where a momentary slip of concentration is enough to end hopes: all of the drama that makes Le Mans irresistible is here. With the incomparable Radio Le Mans team providing detailed commentary every step of the way, the Official Review is the best way to relive this thrilling race in the comfort of your favourite armchair!","duration":91.0,"director":"Duke Video","cast":["Kazuki Nakajima","Fernando Alonso"],"price":12.99,"quantity":9.0,"image":"24.webp","inStock":true,"isDeleted":false,"genre":"Sports"}
{"_id":{"$oid":"5de04d1fb03d8a1b310d8808"},"title":"The Running Man","rating":3.5,"year":2019.0,"description":"Arnold Schwarzenegger stars as Ben Richards, a cop in the totalitarian America of 2019, framed for massacring rioting civilians during a famine. After escaping from jail, Richards tries to prove his innocence, but his efforts are thwarted at every turn by a regime in need of a scapegoat. Richards is captured along with an innocent civilian, Amber Mendez (Maria Conchita Alonso), and they are forced to participate in a violent game show called The Running Man, hosted by the unctuous Damon Killian (Richard Dawson). The object of the game for Richards and Mendez: obtain freedom by staying alive against a gauntlet of skillful assassins like Subzero (Prof. Toru Tanaka) and Captain Freedom (Jesse Ventura), each armed with unique weapons like razor-sharp hockey sticks and chainsaws. With the help of some fellow contestants, Richards is able to tap into government computers and prove his innocence. The Running Man was very loosely based on a short story by Stephen King, who wrote it under the name Richard Bachman.","duration":100.0,"director":"","cast":["Arnold Schwarzenegger","Maria Conchita Alonso","Richard Dawson","Yaphet Kotto"],"price":12.99,"quantity":9.0,"image":"24.webp","inStock":true,"isDeleted":false,"genre":"Sports"}
{"_id":{"$oid":"5de05050b03d8a1b310d8809"},"title":"Catch Me If You Can","rating":4.6,"year":2002,"description":"Frank didn't go to flight school...Frank didn't go to medical school...Frank didn't go to law school...because Frank’s still in high school! Inspired by the true story of a brilliant young master of deception and the FBI agent hot on his trail. Directed by Steven Spielberg and starring Leonardo DiCaprio and Tom Hanks. Frank W. Abagnale, Jr. successfully passes himself off as a pilot, a lawyer and a doctor – all before his 21st birthday!.","duration":140,"director":["Steven Spielberg"],"cast":["Leonardo DiCaprio","Tom Hanks","Christopher Walken","Martin Sheen"],"price":2.99,"quantity":7,"image":"catchme.webp","inStock":true,"isDeleted":false,"genre":"Comedy"}
{"_id":{"$oid":"5de05050b03d8a1b310d880a"},"title":"Moana","rating":4.7,"year":2016.0,"description":"From Walt Disney Animation Studios comes Moana, an epic adventure about a spirited teen who sets sail on a daring mission to prove herself a master wayfinder and fulfill her ancestors’ unfinished quest. During her journey, Moana (Auli‘i Cravalho) meets the once mighty demigod Maui (Dwayne Johnson), and together they cross the ocean on a fun-filled, action-packed voyage, encountering enormous sea creatures, breathtaking underworlds and impossible odds. Along the way, Moana discovers the one thing she’s always sought: her own identity.","duration":108.0,"director":"John Musker","cast":["Auli'i Cravalho","Dwayne Johnson","Rachel House","Temuera Morrison"],"price":14.99,"quantity":20.0,"image":"moana.webp","inStock":true,"isDeleted":false,"genre":"Animation"}
{"_id":{"$oid":"5de04d1fb03d8a1b310d8806"},"title":"Boondockers 16","rating":4.1,"year":2019.0,"description":"The 2018-2019 season brought near-record snowpack and a ridiculous number of deep powder days. The exceptionally deep base opened up new areas and technical creek bottoms that whenever imagined possible, join us for another winter of incredible boon docking, unbelievably scenic locations, and plenty of adventures.","duration":43.0,"director":"Justin Cowett","cast":["Kaltenbacher","Brock Berry","Ryan Nelson"],"price":10.99,"quantity":0,"image":"boond.webp","inStock":false,"isDeleted":false,"genre":"Sports"}
{"_id":{"$oid":"5de04d1fb03d8a1b310d87fc"},"title":"The Least of These","rating":3.9,"year":2019.0,"description":"As the social fabric of life in rural India disintegrates in the late 1990s, journalist Manav Banerjee (Sharman Joshi) moves with his pregnant wife to the State of Orissa in hope of a better life and the promise of a lucrative career. When speculation mounts that local Australian missionary Graham Staines (Stephen Baldwin) is illegally proselytizing leprosy patients, Manav agrees to investigate undercover for the newspaper. What he finds is a series of revelations that are difficult to fathom and even harder to explain, and Manav is forced to make a choice between his own ambition and the truth. In the end, his actions spark a tragic event that is felt around the world. Based on a true story and shot on location in India, The Least of These beautifully illustrates the power of love, hope and forgiveness to overcome hate.","duration":95.0,"director":"Nikhil Pareek","cast":["Sharman Joshi","Stephen Baldwin","Shari Rigby","Prakash Belawadi","Aditi Chengappa","Manoj Mishra"],"price":5.99,"quantity":5,"image":"least.webp","inStock":true,"isDeleted":false,"genre":"Action & adventure"}
{"_id":{"$oid":"5de05050b03d8a1b310d880b"},"title":"The Princess and the Frog","rating":4.7,"year":2009.0,"description":"Walt Disney Animation Studios presents the musical THE PRINCESS AND THE FROG, an animated comedy set in the great city of New Orleans. This is a modern twist on a classic tale featuring a beautiful girl named Tiana (Anika Noni Rose), a frog prince who desperately wants to be human again, and a fateful kiss that leads them both on a hilarious adventure through the mystical bayous of Louisiana. THE PRINCESS AND THE FROG marks the return to hand-drawn animation from the revered team of John Musker and Ron Clements, with music by Oscar®-winning composer Randy Newman.","duration":97.0,"director":"John Musker","cast":["John Goodman","Oprah Winfrey","Jenifer Lewis","Terrence Howard"],"price":14.99,"quantity":5.0,"image":"theprincess.webp","inStock":true,"isDeleted":false,"genre":"Animation"}
{"_id":{"$oid":"5de05050b03d8a1b310d880c"},"title":"London Has Fallen","rating":4.2,"year":2016.0,"description":"The sequel to the worldwide smash hit Olympus Has Fallen, a non-stop, suspenseful action thriller that delivers high-octane excitement through a heightened sense of authenticity. The visceral intensity springs from a timely premise: after the British Prime Minister passes away, his funeral becomes a target of a terrorist organization to destroy some of the world’s most powerful leaders, devastate the British capital, and unleash a terrifying vision of the future. The only hope of stopping it rests on the shoulders of the President of the United States (Aaron Eckhart) and his formidable Secret Service head (Gerard Butler), and an English MI-6 agent (Charlotte Riley) who rightly trusts no one. Morgan Freeman also stars as the Vice President of the United States. (Original Title - London Has Fallen) - 2016 Focus Features. All Rights Reserved.","duration":98.0,"director":"Babak Najafi","cast":["Gerard Butler","Aaron Eckhart","Morgan Freeman","Alon Moni Aboutboul"],"price":9.99,"quantity":16.0,"image":"london.webp","inStock":true,"isDeleted":false,"genre":"Action"}
{"_id":{"$oid":"5de05050b03d8a1b310d880f"},"title":"13 Hours: The Secret Soldiers of Benghazi","rating":4.6,"year":2016.0,"description":"From director Michael Bay 13 HOURS: THE SECRET SOLDIERS OF BENGHAZI is the gripping true story of six elite ex-military operators assigned to protect the CIA who fought back against overwhelming odds when terrorists attacked a U.S. diplomatic compound on September 11 2012. When everything went wrong six men had the courage to do what was right. Based on the nonfiction book 13 Hours: The Inside Account of What Really Happened in Benghazi by New York Times bestselling author Mitchell Zuckoff and Members of the Annex Security Team.","duration":144.0,"director":"Michael Bay","cast":["James Badge Dale","John Krasinski","Max Martini","Nick Jonas"],"price":14.99,"quantity":0,"image":"hours.webp","inStock":false,"isDeleted":true,"genre":"Drama"}
{"_id":{"$oid":"5de05050b03d8a1b310d8810"},"title":"Zero Dark Thirty","rating":4.3,"year":2012.0,"description":"For a decade, an elite team of intelligence and military operatives, working in secret across the globe, devoted themselves to a single goal: to find and eliminate Osama bin Laden. ZERO DARK THIRTY reunites the Oscar-winning team of director-producer Kathryn Bigelow and writer-producer Mark Boal (2009, Best Picture, THE HURT LOCKER) for the story of history's greatest manhunt for the world's most dangerous man.","duration":156.0,"director":"Kathryn Bigelow","cast":["Jessica Chastain","Joel Edgerton","Jason Clarke","Mark Strong"],"price":12.99,"quantity":12.0,"image":"zero.webp","inStock":true,"isDeleted":false,"genre":"Drama"}
{"_id":{"$oid":"5de05050b03d8a1b310d880e"},"title":"Jumanji: Welcome to the Jungle","rating":4.2,"year":2017.0,"description":"Four teenagers in detention discover an old video game console with a game they’ve never heard of. When they decide to play, they are immediately sucked into the jungle world of Jumanji in the bodies of their avatars (Dwayne Johnson, Jack Black, Kevin Hart, and Karen Gillan). They’ll have to complete the adventure of their lives filled with fun, thrills and danger or be stuck in the game forever!","duration":119.0,"director":"Jake Kasdan","cast":["Dwayne Johnson","Jack Black","Kevin Hart","Nick Jonas"],"price":14.99,"quantity":8.0,"image":"jumanji.webp","inStock":true,"isDeleted":false,"genre":"Action"}
{"_id":{"$oid":"5de05050b03d8a1b310d8811"},"title":"Black Hawk Down","rating":4.0,"year":1997.0,"description":"An in depth look at the troubled US intervention in Somalia. We reconstruct the most devastating battles between marines and Somalis using US army broadcasts.","duration":156.0,"director":"Chris Mills","cast":["Mike Goodale","Shawn Nelson","Jason Clarke","Dale Sizemore"],"price":7.99,"quantity":21.0,"image":"black.webp","inStock":true,"isDeleted":false,"genre":"Documentry"}
{"_id":{"$oid":"5de05050b03d8a1b310d8812"},"title":"The Intern (2015)","rating":4.3,"year":2015.0,"description":"In The Intern, Ben Whittaker (Robert De Niro) is a 70-year-old widower who has discovered that retirement isn’t all it’s cracked up to be. Seizing an opportunity to get back in the game, he becomes a senior intern at an online fashion site, founded and run by Jules Ostin (Anne Hathaway).","duration":121.0,"director":"Nancy Meyers","cast":["Robert De Niro","Anne Hathaway","Anders Holm","Rene Russo"],"price":4.99,"quantity":21.0,"image":"intern.webp","inStock":true,"isDeleted":false,"genre":"Comedy"}
{"_id":{"$oid":"5de05050b03d8a1b310d8813"},"title":"Grudge Match","rating":4.1,"year":2014.0,"description":"Oscar® winner Robert De Niro (Raging Bull, Silver Linings Playbook) and Oscar® nominee Sylvester Stallone (the Rocky films, The Expendables) play Billy The Kid McDonnen and Henry Razor Sharp, two local Pittsburgh fighters whose fierce rivalry put them in the national spotlight. Each had scored a victory against the other during their heyday, but in 1983, on the eve of their decisive third match, Razor suddenly announced his retirement, refusing to explain why but effectively delivering a knock-out punch to both their careers. Thirty years later, boxing promoter Dante Slate Jr., seeing big dollar signs, makes them an offer they can't refuse: to re-enter the ring and settle the score once and for all.","duration":113.0,"director":"Peter Segal","cast":["Jon Bernthal","Sylvester Stallone","Robert De Niro","Kevin Hart"],"price":7.99,"quantity":23.0,"image":"grudge.webp","inStock":true,"isDeleted":false,"genre":"Comedy"}
{"_id":{"$oid":"5de05050b03d8a1b310d8814"},"title":"Deadpool","rating":4.7,"year":2016.0,"description":"Hold onto your chimichangas, folks. From the studio that brought you all 3 Taken films comes the block-busting, fourth-wall-breaking masterpiece about Marvel Comics’ sexiest anti-hero! Starring God’s perfect idiot Ryan Reynolds and a bunch of other actors,DEADPOOL is a giddy slice of awesomeness packed with more twists than Deadpool’s enemies’ intestines and more action than prom night. Amazeballs!","duration":113.0,"director":"Tim Miller","cast":["Gina Carano","Ryan Reynolds","Morena Baccarin","Ed Skrein"],"price":7.99,"quantity":17.0,"image":"deadpool.webp","inStock":true,"isDeleted":false,"genre":"Sci-fi & fantasy"}
{"_id":{"$oid":"5de05050b03d8a1b310d8815"},"title":"X-Men Origins: Wolverine","rating":4,"year":2020,"description":"Heroic Hugh Jackman breathes the fire into Wolverine — with a vengeance! This pulse-pounding action thriller sinks razor-sharp adamantium claws into the mysterious origins of Logan/Wolverine: his epically violent and romantic past, his complex relationship with Victor Creed/Sabretooth (Liev Schreiber), and the ominous Weapon X program that unleashes his primal fury. Along the way, Wolverine also encounters legendary new mutants, including Deadpool and Gambit. You'll go berserker for this deeper, darker, more-spectacular-than-ever chapter of the X-Men saga!","duration":107,"director":["Gavin Hood"],"cast":["Hugh Jackman","Liev Schreiber","Danny Huston","Dominic Monaghan"],"price":7.99,"quantity":17,"image":"xman.webp","inStock":true,"isDeleted":false,"genre":"Sci-fi & fantasy"}
{"_id":{"$oid":"5de05050b03d8a1b310d880d"},"title":"Mission: Impossible - Fallout","rating":4.5,"year":2018.0,"description":"On a dangerous assignment to recover stolen plutonium, Ethan Hunt (Tom Cruise) chooses to save his team over completing the mission, allowing nuclear weapons to fall into the hands of a deadly network of highly-skilled operatives intent on destroying civilization. Now, with the world at risk, Ethan and his IMF team (Simon Pegg, Ving Rhames, Rebecca Ferguson) are forced to become reluctant partners with a hard-hitting CIA agent (Henry Cavill) as they race against time to stop the nuclear fallout. There’s never been a threat more destructive, stunts so jaw-dropping or a mission so impossible!","duration":147.0,"director":"Christopher McQuarrie","cast":["Tom Cruise"],"price":7.99,"quantity":13.0,"image":"mission.webp","inStock":true,"isDeleted":false,"genre":"Action"}
{"_id":{"$oid":"5de05050b03d8a1b310d8816"},"title":"X2","rating":4.3,"year":2003.0,"description":"Heroic Hugh Jackman breathes the fire into Wolverine — with a vengeance! This pulse-pounding action thriller sinks razor-sharp adamantium claws into the mysterious origins of Logan/Wolverine: his epically violent and romantic past, his complex relationship with Victor Creed/Sabretooth (Liev Schreiber), and the ominous Weapon X program that unleashes his primal fury. Along the way, Wolverine also encounters legendary new mutants, including Deadpool and Gambit. You'll go berserker for this deeper, darker, more-spectacular-than-ever chapter of the X-Men saga!","duration":133.0,"director":"Bryan Singer","cast":["Hugh Jackman","James Marsden","Patrick Stewart","Ian Mckellen"],"price":7.99,"quantity":17.0,"image":"xtwo.webp","inStock":true,"isDeleted":false,"genre":"Sci-fi & fantasy"}
{"_id":{"$oid":"5de05050b03d8a1b310d8818"},"title":"Train to Busan","rating":4.5,"year":2016.0,"description":"TRAIN TO BUSAN is a harrowing zombie horror-thriller that follows a group of terrified passengers fighting their way through a countrywide viral outbreak, trapped on a suspicion-filled, blood-drenched bullet train ride to the Safe Zone, which may or may not still be there.","duration":117.0,"director":"Yeon Sang-ho","cast":["Kim Ui-Seongk","Gong Yoo","Patrick Stewart","Jung Yu-mi"],"price":12.99,"quantity":13.0,"image":"train.webp","inStock":true,"isDeleted":false,"genre":"Mystery"}
{"_id":{"$oid":"5de05050b03d8a1b310d8817"},"title":"Seoul Station","rating":4.3,"year":2016.0,"description":"The animated prequel to the box office record-breaker TRAIN TO BUSAN and the latest from director Yeon Sang-ho, SEOUL STATION is a fresh and terrifying take on the modern zombie film. A man sleeping in Seoul Station becomes a catalyst for the pandemonium in downtown Seoul; a zombie apocalypse. The rapidly- spreading infection propels an authentic family drama, drawing mordant parallels to real-world social horrors.","duration":92.0,"director":"Sang-ho Yeon","cast":["Seung-Ryong Ryu","Eun-Kyung Shim","Patrick Stewart","Joon Lee"],"price":9.99,"quantity":3.0,"image":"seoul.webp","inStock":true,"isDeleted":false,"genre":"Horror"}
{"_id":{"$oid":"5de05050b03d8a1b310d881a"},"title":"Unknown","rating":4.2,"year":2011.0,"description":"TRAIN TO BUSAN is a harrowing zombie horror-thriller that follows a group of terrified passengers fighting their way through a countrywide viral outbreak, trapped on a suspicion-filled, blood-drenched bullet train ride to the Safe Zone, which may or may not still be there.","duration":113.0,"director":"Jaume Collet-Serra","cast":["Liam Neeson","Diane Kruger","January Jones","Frank Langella"],"price":4.99,"quantity":11.0,"image":"unknown.webp","inStock":true,"isDeleted":false,"genre":"Drama"}
{"_id":{"$oid":"5de05050b03d8a1b310d8819"},"title":"Last Passenger","rating":2.3,"year":2020,"description":"LAST PASSENGER is a contained yet kinetic thriller with a relentless momentum, melding suspense, action, and genuine heart to get audience pulses racing -- at 100 miles per hour. Lewis Shaler (Dougray Scott) is an overworked doctor and devoted single dad heading home with his young son Max on the last train from London. When he strikes up a conversation with a beautiful and flirtatious stranger (Kara Tointon), Lewis believes life is finally looking up. But events then take a dark turn when Lewis discovers the guard has mysteriously vanished and the brakes have been sabotaged. Unknown to the handful of remaining passengers, a vengeful sociopath has taken control of the train and is hell-bent on crashing it, taking his passengers with him to the grave. As the speeding locomotive ploughs through stations and level crossings, the body count rises and panic turns to terror. Lewis realizes that the police are powerless to stop the diesel-powered 'slammer' train, and the desperate passengers must find their own way out of this nightmare. Lewis takes the lead in a series of increasingly perilous missions to stop the train before the driver can realize his dark plan…","duration":96,"director":["Omid Nooshin"],"cast":["Lindsay Duncan","Dougray Scott","Kara Tointon","David Schofield"],"price":9.99,"quantity":18,"image":"last.webp","inStock":true,"isDeleted":false,"genre":"Thriller"}
